import sys
from collections import deque
sys.stdin = open("C:/Users/현대오토13/Desktop/수진_개인파일/파이썬/input.txt","r")

shapes = [
    [[1, 1], 
     [1, 1]], # 네모

    [[1, 1, 1, 1]], # 길쭉이 1
    [[1], [1], [1], [1]], # 길쭉이 2

    [[1, 1, 1], 
     [0, 1, 0]], # T-모양 1
    [[0, 1, 0], 
     [1, 1, 1]], # T-모양 2
    [[1, 0], 
     [1, 1], 
     [1, 0]], # T-모양 3
    [[0, 1], 
     [1, 1], 
     [0, 1]], # T-모양 4

    [[1, 1, 0], 
     [0, 1, 1]], # 꺽은 모양 1
    [[0, 1, 1], 
     [1, 1, 0]], # 꺽은 모양 2
    [[1, 0], 
     [1, 1], 
     [0, 1]], # 꺽은 모양 3
    [[0, 1], 
     [1, 1], 
     [1, 0]], # 꺽은 모양 4

    [[1, 1, 1], 
     [0, 0, 1]], # L-모양 1
    [[0, 0, 1], 
     [1, 1, 1]], # L-모양 2
    [[1, 1, 1], 
     [1, 0, 0]], # L-모양 3
    [[1, 0, 0], 
     [1, 1, 1]], # L-모양 4

    [[1, 1], 
     [1, 0], 
     [1, 0]], # L-모양 5
    [[1, 1], 
     [0, 1], 
     [0, 1]], # L-모양 6
    [[1, 0], 
     [1, 0], 
     [1, 1]], # L-모양 7
    [[0, 1], 
     [0, 1], 
     [1, 1]]  # L-모양 8
]

def maximize():
    h,w = len(),len(s[0])
    opt = 0

def solve(n, m, A):
    opt = 0
    for k in range(len(shapes)):
        opt = max(opt,maximize())
    return opt

n, m = map(int, input().split())
A = [list(map(int, input().split())) for _ in range(n)]
print(solve(n, m, A))